documents/images/graphio/bxdf/UsdPrimvarReader_boolean.dot
digraph {
  rankdir = LR;
    IMP_UsdPrimvarReader_boolean_primvar [label= "geompropvalue"];
    IMP_UsdPrimvarReader_boolean_primvar[shape = box];
    IMP_UsdPrimvarReader_boolean_primvar ->     IMP_UsdPrimvarReader_boolean_out;
    IMP_UsdPrimvarReader_boolean_out [label= "out"];
    IMP_UsdPrimvarReader_boolean_out[shape = box]; 
    IMP_UsdPrimvarReader_boolean_varnameINT [label="varname"];
    IMP_UsdPrimvarReader_boolean_varnameINT [shape = ellipse];
    IMP_UsdPrimvarReader_boolean_primvar [label="geompropvalue"];
    IMP_UsdPrimvarReader_boolean_varnameINT -> IMP_UsdPrimvarReader_boolean_primvar [label=".geomprop"];
    IMP_UsdPrimvarReader_boolean_fallbackINT [label="fallback"];
    IMP_UsdPrimvarReader_boolean_fallbackINT [shape = ellipse];
    IMP_UsdPrimvarReader_boolean_primvar [label="geompropvalue"];
    IMP_UsdPrimvarReader_boolean_fallbackINT -> IMP_UsdPrimvarReader_boolean_primvar [label=".default"];
}
